In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series(np.arange(6), index=list('abcdef'))
s

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int32

In [3]:
s.index.is_unique

True

In [4]:
s.index.unique()

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [5]:
s = pd.Series(np.arange(6), index=list('abcdba'))
s

a    0
b    1
c    2
d    3
b    4
a    5
dtype: int32

In [6]:
s.groupby(s.index).first()# groupby分组处理，相同索引只要第一项

a    0
b    1
c    2
d    3
dtype: int32

In [7]:
s.groupby(s.index).sum()#相同索引的求和

a    5
b    5
c    2
d    3
dtype: int32

In [8]:
#多级索引，相当于一个元组
a = [['a','a','a','b','b','c','c'], [1, 2, 3, 1, 2, 2, 3]]
t = list(zip(*a)) #将列表组装起来
index = pd.MultiIndex.from_tuples(t, names=['level1', 'level2'])# 一级索引，二级索引
index

MultiIndex(levels=[['a', 'b', 'c'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2], [0, 1, 2, 0, 1, 1, 2]],
           names=['level1', 'level2'])

In [9]:
s = pd.Series(np.random.randn(7), index=index)

In [10]:
s

level1  level2
a       1         0.260867
        2        -0.448295
        3         0.807813
b       1         1.412360
        2         0.105913
c       2        -0.187553
        3         0.983454
dtype: float64

In [11]:
s['b':'c']

level1  level2
b       1         1.412360
        2         0.105913
c       2        -0.187553
        3         0.983454
dtype: float64

In [12]:
s[:, 2]

level1
a   -0.448295
b    0.105913
c   -0.187553
dtype: float64

In [13]:
# pandas分组运算，三步：拆分-应用-合并
df = pd.DataFrame({'key1': ['a','a','b','b','a'],
                  'key2': ['one','two','one','two','one'],
                  'data1': np.random.randint(1,10,5),
                  'data2': np.random.randint(1,10,5)})

In [14]:
df

   data1  data2 key1 key2
0      1      3    a  one
1      2      4    a  two
2      6      9    b  one
3      9      4    b  two
4      9      2    a  one

In [15]:
df['data1'].groupby(df['key1']).mean()

key1
a    4.0
b    7.5
Name: data1, dtype: float64

In [16]:
df['data1'].groupby([df['key1'], df['key2']]).sum()

key1  key2
a     one     10
      two      2
b     one      6
      two      9
Name: data1, dtype: int32

In [17]:
df['data1'].groupby([df['key1'], df['key2']]).size()#这个分组里面有几个元素

key1  key2
a     one     2
      two     1
b     one     1
      two     1
Name: data1, dtype: int64

In [18]:
df.groupby(['key1']).sum()

      data1  data2
key1
a        12      9
b        15     13

In [19]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
   data1  data2 key1 key2
0      1      3    a  one
1      2      4    a  two
4      9      2    a  one
b
   data1  data2 key1 key2
2      6      9    b  one
3      9      4    b  two

In [20]:
df.dtypes# 根据数据类型分组

data1     int32
data2     int32
key1     object
key2     object
dtype: object

In [21]:
df.groupby(df.dtypes, axis=1).sum()

   int32 object
0      4   aone
1      6   atwo
2     15   bone
3     13   btwo
4     11   aone

In [22]:
# 用函数分组,函数返回值一样的话就分为一组,返回值为key的长度，长度一样的分为一组
df = pd.DataFrame(np.random.randint(1, 10, (5, 5)),
                 index=['alice', 'bob', 'gretchen', 'candy', 'emily'],
                 columns=['a', 'b', 'c', 'd', 'e'])
def _group_key(idx):
    print(idx)
    return len(idx)
df.groupby(_group_key).size()

alice
bob
gretchen
candy
emily

3    1
5    3
8    1
dtype: int64

In [23]:
df.groupby(len).size()

3    1
5    3
8    1
dtype: int64

In [24]:
df.groupby(len).sum()

    a   b   c   d   e
3   4   5   1   7   4
5  14  10  12  19  13
8   1   6   1   6   6

In [25]:
df

          a  b  c  d  e
alice     7  8  2  8  4
bob       4  5  1  7  4
gretchen  1  6  1  6  6
candy     2  1  2  3  1
emily     5  1  8  8  8

In [27]:
#聚合运算
df.groupby('a').sum()

   b  c  d  e
a
1  6  1  6  6
2  1  2  3  1
4  5  1  7  4
5  1  8  8  8
7  8  2  8  4

In [28]:
df.groupby('a').mean()

   b  c  d  e
a
1  6  1  6  6
2  1  2  3  1
4  5  1  7  4
5  1  8  8  8
7  8  2  8  4

In [29]:
df.groupby('a').describe()

      b                                       c      ...     d          e  \
  count mean std  min  25%  50%  75%  max count mean ...   75%  max count
a                                                    ...
1   1.0  6.0 NaN  6.0  6.0  6.0  6.0  6.0   1.0  1.0 ...   6.0  6.0   1.0
2   1.0  1.0 NaN  1.0  1.0  1.0  1.0  1.0   1.0  2.0 ...   3.0  3.0   1.0
4   1.0  5.0 NaN  5.0  5.0  5.0  5.0  5.0   1.0  1.0 ...   7.0  7.0   1.0
5   1.0  1.0 NaN  1.0  1.0  1.0  1.0  1.0   1.0  8.0 ...   8.0  8.0   1.0
7   1.0  8.0 NaN  8.0  8.0  8.0  8.0  8.0   1.0  2.0 ...   8.0  8.0   1.0


  mean std  min  25%  50%  75%  max
a
1  6.0 NaN  6.0  6.0  6.0  6.0  6.0
2  1.0 NaN  1.0  1.0  1.0  1.0  1.0
4  4.0 NaN  4.0  4.0  4.0  4.0  4.0
5  8.0 NaN  8.0  8.0  8.0  8.0  8.0
7  4.0 NaN  4.0  4.0  4.0  4.0  4.0

[5 rows x 32 columns]

In [30]:
#自定义聚合函数
grouped = df.groupby('a')
def peak_range(s):
    print(type(s))
    return s.max() - s.min()
grouped.agg(peak_range)

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

   b  c  d  e
a
1  0  0  0  0
2  0  0  0  0
4  0  0  0  0
5  0  0  0  0
7  0  0  0  0

In [32]:
grouped.agg(['std', 'mean', 'sum', ('range', peak_range)])

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

    b                  c                  d                  e
  std mean sum range std mean sum range std mean sum range std mean sum range
a
1 NaN    6   6     0 NaN    1   1     0 NaN    6   6     0 NaN    6   6     0
2 NaN    1   1     0 NaN    2   2     0 NaN    3   3     0 NaN    1   1     0
4 NaN    5   5     0 NaN    1   1     0 NaN    7   7     0 NaN    4   4     0
5 NaN    1   1     0 NaN    8   8     0 NaN    8   8     0 NaN    8   8     0
7 NaN    8   8     0 NaN    2   2     0 NaN    8   8     0 NaN    4   4     0